README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-20 Wed 12:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mind palace: Probabilistic Graphical Models</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dong" />
</head>
<body>
<div id="content">
<h1 class="title">Mind palace: Probabilistic Graphical Models</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1f7d78">1. Book and Monograph:</a></li>
<li><a href="#org8aad52a">2. Inference and Learning of PGMs</a>
<ul>
<li><a href="#org9bf07a4">2.1. Inference methods and techniques</a>
<ul>
<li><a href="#orge27741c">2.1.1. Application Consideration</a></li>
<li><a href="#org7c63617">2.1.2. Classical Inference Methods</a></li>
</ul>
</li>
<li><a href="#org3e42279">2.2. Neural network based methods</a>
<ul>
<li><a href="#org31a3e4a">2.2.1. Graphical Neural Networks</a></li>
<li><a href="#orgea90ea3">2.2.2. Learning messages</a></li>
<li><a href="#orga1e7443">2.2.3. Variational methods</a></li>
<li><a href="#orge8f8e69">2.2.4. Neural density function estimation</a></li>
</ul>
</li>
<li><a href="#orgbcbb834">2.3. Learning of Graphical Models</a>
<ul>
<li><a href="#org41b34d0">2.3.1. Parameter Learning</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4a169d3">3. PGM and Decision-making in Dynamic Systems</a>
<ul>
<li><a href="#org37c5b6e">3.1. Courses</a></li>
</ul>
</li>
<li><a href="#org40a940a">4. In connecting with others</a>
<ul>
<li><a href="#org4b02641">4.1. GANs</a></li>
<li><a href="#org4951404">4.2. Discrete GAN or RBM or Autoencoder</a></li>
<li><a href="#orgb890afc">4.3. Optimal Transport (likelihood-free learning)</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orge1f7d78" class="outline-2">
<h2 id="orge1f7d78"><span class="section-number-2">1</span> Book and Monograph:</h2>
<div class="outline-text-2" id="text-1">
<p>
Book CACHE:
</p>

<p>
Komodakis etc, 2016, <a href="https://www.nowpublishers.com/article/Details/CGV-066">(Hyper)-Graphs Inference through Convex Relaxations and Move Making Algorithms: Contributions and Applications in Artificial Vision</a>
</p>

<p>
Bogdan Savchynskyy, 2019, <a href="file:///home/dong/Documents/my_eBooks/mLearning/discrete_graphical_models_an_optimization_perspective.pdf">Discrete Graphical Models &#x2013; An Optimization Perspective</a> &lt; 
</p>

<p>
Angelino, 2016, <a href="https://www.nowpublishers.com/article/Details/MAL-052">Patterns of Scalable Bayesian Inference</a>
</p>

<p>
Nowozin, 2011, <a href="http://www.nowozin.net/sebastian/papers/nowozin2011structured-tutorial.pdf">Structured Learning and Prediction in Computer Vision</a> &lt;
</p>


<p>
Books or Monograph:
</p>

<p>
Kingma and Welling, 2019, <a href="file:///home/dong/Documents/my_eBooks/mLearning/introduction_to_variatinal_autoencoders.pdf">An Introduction to Variational Autoencoders</a> 
</p>

<p>
Sutton, 2010, <a href="https://homepages.inf.ed.ac.uk/csutton/publications/crftut-fnt.pdf">An Introduction to Conditional Random Fields</a>
</p>

<p>
Wainwright, 2008, <a href="file:///home/dong/Documents/my_eBooks/mLearning/graphical_models_wainwright.pdf">Graphical Models, Exponential Families, and Variational Inference</a>
</p>

<p>
Koller, 2009, <a href="file:///home/dong/Documents/my_eBooks/mLearning/probabilistic_graphical_models_principles_techniques.pdf">Probabilistic graphical models: principles and techniques</a>
</p>

<p>
Mark Rowland, 2018, <a href="https://www.repository.cam.ac.uk/handle/1810/287479">Structure in Machine Learning: Graphical Models and Monte Carlo Methods</a>
</p>

<p>
Yingzhen Li, 2018, <a href="https://www.repository.cam.ac.uk/handle/1810/277549">Approximate Inference: New Visions</a>
</p>

<p>
Adrian Weller, 2014, <a href="http://mlg.eng.cam.ac.uk/adrian/phd_FINAL.pdf">Methods for Inference in Graphical Models</a>
</p>

<p>
Ihler, Alexander:
</p>

<p>
Lou, Qi, 2018, <a href="https://escholarship.org/uc/item/7sc0m97f">Anytime Approximate Inference in Graphical Models</a>
</p>

<p>
Ping, Wei, 2016, <a href="https://escholarship.org/uc/item/7q90z4b5">Learning and Inference in Latent Variable Graphical Models</a>
</p>

<p>
Forouzan, Sholeh, 2015, <a href="https://escholarship.org/uc/item/5n4733cz">Approximate Inference in Graphical Models</a>
</p>

<p>
Qiang, Liu, 2014, <a href="https://escholarship.org/uc/item/92p8w3xb">Reasoning and Decisions in Probabilistic Graphical Models - A Unified Framework</a>
</p>

<p>
Minka:
</p>

<p>
Yuan Qi, 2005, <a href="https://affect.media.mit.edu/pdfs/05.qi-phd.pdf">Extending Expectation Propagation for Graphical Models</a>
</p>

<p>
Thomas P Minka, 2001, <a href="https://tminka.github.io/papers/ep/minka-thesis.pdf">A family of algorithms for approximate Bayesian inference</a>
</p>
</div>
</div>


<div id="outline-container-org8aad52a" class="outline-2">
<h2 id="org8aad52a"><span class="section-number-2">2</span> Inference and Learning of PGMs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9bf07a4" class="outline-3">
<h3 id="org9bf07a4"><span class="section-number-3">2.1</span> Inference methods and techniques</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orge27741c" class="outline-4">
<h4 id="orge27741c"><span class="section-number-4">2.1.1</span> Application Consideration</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li><p>
What will I get by applying the RNN's mean field explanation to RNN augmented Kalman filter?
</p>

<p>
Ref1: <a href="https://papers.nips.cc/paper/9532-combining-generative-and-discriminative-models-for-hybrid-inference.pdf">Satorras, 2019, Combining Generative and Discriminative Models for Hybrid Inference</a>
</p>

<p>
Ref2: <a href="https://arxiv.org/pdf/1502.03240.pdf">Zheng, 2019, Conditional Random Fields as Recurrent Neural Networks</a>
</p>

<p>
Ref3: <a href="https://arxiv.org/abs/1210.5644">Krahenbuhl, 2011, Efficient Inference in Fully Connected CRFs with Gaussian Edge Potentials</a>
</p></li>
</ol>
</div>
</div>




<div id="outline-container-org7c63617" class="outline-4">
<h4 id="org7c63617"><span class="section-number-4">2.1.2</span> Classical Inference Methods</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>Hand-crafted message passing, BP, GBP, Tree-reweighted BP and EP, PowerEP</li>

<li><p>
<font color="green">Alpha belief propagation</font>
</p>

<p>
<font color="green"> convergence property of Alpha belief propagation</font>
</p></li>

<li><p>
Tree-reweighted BP for MAP problems (for HW map problem complete graph)
</p>

<p>
Refer to <a href="https://papers.nips.cc/paper/2206-exact-map-estimates-by-hypertree-agreement.pdf">exact MAP estimates by hypertree agreement</a>
</p>

<p>
<a href="http://ssg.mit.edu/group/willsky/publ_pdfs/166_pub_AISTATS.pdf">tree-reweighted belief propagation algorithms and approximated ML esimation by pseudo-moment matching</a>
</p></li>

<li><p>
Generalized BP for marginal distributions, <a href="https://www.cs.princeton.edu/courses/archive/spring06/cos598C/papers/YedidaFreemanWeiss2004.pdf">yedidis 2005, constructing free energy approximations and Generalized belief propagation algorithms</a>
</p>

<p>
What about GBP for MAP problem?
</p></li>

<li>Tree-structured EP, <a href="https://tminka.github.io/papers/eptree/minka-eptree.pdf">Tree-structured approximations by expectation propagation</a></li>

<li>Convergence Analysis, Roosta, 2008, <a href="https://ieeexplore.ieee.org/document/4599175">Convergence Analysis of Reweighted Sum-Product Algorithms</a></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org3e42279" class="outline-3">
<h3 id="org3e42279"><span class="section-number-3">2.2</span> Neural network based methods</h3>
<div class="outline-text-3" id="text-2-2">
</div>
