README.html
<div id="outline-container-org31a3e4a" class="outline-4">
<h4 id="org31a3e4a"><span class="section-number-4">2.2.1</span> Graphical Neural Networks</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li><p>
literature development path
</p>

<p>
Half-automated message passing, <a href="https://papers.nips.cc/paper/5070-learning-to-pass-expectation-propagation-messages.pdf">Learning to Pass Expectation Propagation Messages</a> , message-level automation
</p>

<p>
Training neural network to do message passing, <a href="https://arxiv.org/abs/1803.07710">Inference in Probabilistic Graphical Models by Graph Neural Networks</a> , train NN for message updates, and also NN for mapping messages to estimations. A good property observed in the work, trained NNs can be used for different factor graphs with different potentials and structures
Same track, <a href="https://arxiv.org/abs/1905.06214">GMNN: Graph Markov Neural Networks</a>, semi-supervised learning, EM is used for training.
</p>

<p>
More generalized computation power: <a href="https://github.com/deepmind/graph_nets">Graph Net</a>, A graph network takes a graph as input and returns a graph as output. The input graph has edge- (E ), node- (V ), and global-level (u) attributes. The output graph has the same structure, but updated attributes. Graph networks are part of the broader family of "graph neural networks".
</p>

<p>
Idea to investigate: i. Using graph net or graphical neural network for belief updates, is it possible to train one graph net, such that it take factor graph in and output factor graph with belief converged already?
</p>

<p>
ii. using graph net, especially the GMNN, solves HW's symbol detection problem. Pilot symbols as labeled data, rest detection rely on the inference of semi-supervised learning.
</p></li>

<li><p>
alpha belief propagation with GAN ?
</p>

<p>
Reference:
</p>

<p>
<a href="https://arxiv.org/abs/1612.05048">Adversarial Message Passing For Graphical Models</a>
</p>

<p>
<a href="https://arxiv.org/pdf/1905.12660.pdf">Training Generative Adversarial Networks from Incomplete Observations using Factorised Discriminators</a>
</p></li>
</ol>

<p>
More reference:
</p>

<p>
<a href="https://persagen.com/files/misc/scarselli2009graph.pdf">Scarselli, 2009, The graph neural network model</a>
</p>
</div>
</div>

<div id="outline-container-orgea90ea3" class="outline-4">
<h4 id="orgea90ea3"><span class="section-number-4">2.2.2</span> Learning messages</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Lin, 2015, <a href="http://papers.nips.cc/paper/5791-deeply-learning-the-messages-in-message-passing-inference.pdf">Deeply Learning the Messages in Message Passing Inference</a>
</p>
</div>
</div>

<div id="outline-container-orga1e7443" class="outline-4">
<h4 id="orga1e7443"><span class="section-number-4">2.2.3</span> Variational methods</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
NIPS, Tutorial 2016, <a href="https://media.nips.cc/Conferences/2016/Slides/6199-Slides.pdf">Variational Inference</a>
</p>

<p>
Kingma and Welling, 2014, Autoencoder: <a href="https://arxiv.org/abs/1312.6114">Auto-Encoding Variational Bayes</a>
</p>

<p>
Kuleshov and Ermon, 2017, NVIL: <a href="https://arxiv.org/abs/1711.02679">Neural Variational Inference and Learning in Undirected Graphical Models</a>
</p>

<p>
Li, etc, 2020, AdVIL: <a href="https://arxiv.org/abs/1901.08400">To Relieve Your Headache of Training an MRF, Take AdVIL</a>
</p>

<p>
Lazaro-Gredilla, 2019 (Vicarious AI), <a href="https://arxiv.org/abs/1912.02893">Learning undirected models via query training</a>
</p>

<p>
Sobolev and Vetrov, 2019, (Section 3 gives interesting discussion on literature works) <a href="http://papers.nips.cc/paper/8350-importance-weighted-hierarchical-variational-inference">Importance Weighted Hierarchical Variational Inference</a>
</p>

<p>
Kingma, et al, 2016, <a href="https://papers.nips.cc/paper/6581-improved-variational-inference-with-inverse-autoregressive-flow">Improved Variational Inference with Inverse Autoregressive Flow</a>
</p>

<p>
Rezende, Mohamed, 2015, <a href="https://arxiv.org/abs/1505.05770">Variational Inference with Normalizing Flows</a>
</p>
</div>
</div>

<div id="outline-container-orge8f8e69" class="outline-4">
<h4 id="orge8f8e69"><span class="section-number-4">2.2.4</span> Neural density function estimation</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Chen et al, 2018, ODE: <a href="https://papers.nips.cc/paper/7892-neural-ordinary-differential-equations">Neural Ordinary Differential Equations</a>
</p>

<p>
Kingma, Dhariwal, 2018, <a href="https://arxiv.org/abs/1807.03039">Glow: Generative Flow with Invertible 1x1 Convolutions</a>
</p>

<p>
Dinh, Sohl-Dickstein, Bengio, 2017, <a href="https://arxiv.org/pdf/1605.08803.pdf">Density Estimation using Real NVP</a>
</p>

<p>
Dinh, Krueger, Bengio, 2014, <a href="https://arxiv.org/abs/1410.8516">NICE: Non-linear independent component estimation</a>
</p>

<p>
Inverse autoregreeeive flow as in previous subsection.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbcbb834" class="outline-3">
<h3 id="orgbcbb834"><span class="section-number-3">2.3</span> Learning of Graphical Models</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org41b34d0" class="outline-4">
<h4 id="org41b34d0"><span class="section-number-4">2.3.1</span> Parameter Learning</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li><p>
Learning graphical model parameters by approximate inference
</p>

<p>
Domke, 2013, <a href="https://ieeexplore.ieee.org/abstract/document/6420841">Learning Graphical Model Parameters with Approximate Marginal Inference</a>
</p>

<p>
Tang, 2015, <a href="https://arxiv.org/abs/1503.01228">Bethe Learning of Conditional Random Fields via MAP Decoding</a>
</p>

<p>
You Lu, 2019, <a href="https://www.aaai.org/ojs/index.php/AAAI/article/view/4357">Block Belief Propagation for Parameter Learning in Markov Random Fields</a>
</p>

<p>
Hazan, 2016, <a href="http://www.jmlr.org/papers/v17/13-260.html">Blending Learning and Inference in Conditional Random Fields</a>
</p></li>

<li><p>
Learning of MRF with neural networks
</p>

<p>
Wiseman and Kim, 2019, <a href="https://papers.nips.cc/paper/9687-amortized-bethe-free-energy-minimization-for-learning-mrfs.pdf">Amortized Bethe Free Energy Minimization for Learning MRFs</a>
</p>

<p>
Kuleshov and Ermon, 2017, <a href="https://arxiv.org/abs/1711.02679">Neural Variational Inference and Learning in Undirected Graphical Models</a>
</p></li>
</ol>


<ol class="org-ol">
<li><p>
Learning of Directed Graphs
</p>

<p>
Chongxuan Li, 2020, <a href="https://arxiv.org/abs/1901.08400">To Relieve Your Headache of Training an MRF, Take AdVIL</a>
</p>

<p>
Mnih and Gregor, 2014, <a href="https://arxiv.org/abs/1402.0030">Neural Variational Inference and Learning in Belief Networks</a>
</p>

<p>
NIPS, Tutorial 2016, <a href="https://media.nips.cc/Conferences/2016/Slides/6199-Slides.pdf">Variational Inference</a>
</p></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org4a169d3" class="outline-2">
<h2 id="org4a169d3"><span class="section-number-2">3</span> PGM and Decision-making in Dynamic Systems</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Sutton, Barto, 2018, <a href="https://github.com/FirstHandScientist/Reinforcement-Learning-2nd-Edition-by-Sutton-Exercise-Solutions">Reinforcement learning (2ed edition)</a></li>

<li>Bubeck, Cesa-Bianchi, 2012, <a href="https://www.microsoft.com/en-us/research/wp-content/uploads/2017/01/SurveyBCB12.pdf">Regret Analysis of Stochastic and Nonstochastic Multi-armed Bandit Problems</a>, Now publisher, Foundations and trends in machine learning</li>

<li>Ziebart, 2010, <a href="https://www.cs.cmu.edu/~bziebart/publications/thesis-bziebart.pdf">Modeling Purposeful Adaptive Behavior with the Principle of Maximum Causal Entropy</a></li>

<li>Levin, 2018, <a href="https://arxiv.org/abs/1805.00909">Reinforcement Learning and Control as Probabilistic Inference: Tutorial and Review</a></li>

<li>Haarnoja, et al 2017, <a href="https://arxiv.org/pdf/1702.08165.pdf">Reinforcement Learning with Deep Energy-Based Policies</a></li>

<li>Martin L. Puterman, 2014, Markov Decision Processes: Discrete Stochastic Dynamic Programming</li>

<li>Szepesvari, 2009, <a href="https://sites.ualberta.ca/~szepesva/papers/RLAlgsInMDPs-lecture.pdf">Algorithms for Reinforcement Learning</a></li>
</ul>
</div>
