README.org
** Courses

- [[https://www.davidsilver.uk/teaching/][Reinforcement Learning (UCL)]]
- [[http://rail.eecs.berkeley.edu/deeprlcourse/][Deep Reinforcement Learning (CS285)]]
- [[https://www.youtube.com/playlist?list=PLqYmG7hTraZDNJre23vqCGIVpfZ_K2RZs][Advanced Deep Learning & Reinforcement Learning]]

    
* In connecting with others
+ [[https://github.com/otokonoko8/implicit-variational-inference][Repos: Advanced-variational-inference-paper]]

+ [[https://github.com/otokonoko8/deep-Bayesian-nonparametrics-papers][Repos: Deep-Bayesian-nonparametrics-papers]] 

** GANs

** Discrete GAN or RBM or Autoencoder

** Optimal Transport (likelihood-free learning)

... Matthed Thorpe, 2018, [[http://www.math.cmu.edu/~mthorpe/OTNotes][Introduction to Optimal Transport]]
... Peyre, Cuturi, 2018, Computational Optimal Transport, [[https://optimaltransport.github.io/resources/][Codes and slides for OT]]




   








