README.html

<div id="outline-container-org37c5b6e" class="outline-3">
<h3 id="org37c5b6e"><span class="section-number-3">3.1</span> Courses</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://www.davidsilver.uk/teaching/">Reinforcement Learning (UCL)</a></li>
<li><a href="http://rail.eecs.berkeley.edu/deeprlcourse/">Deep Reinforcement Learning (CS285)</a></li>
<li><a href="https://www.youtube.com/playlist?list=PLqYmG7hTraZDNJre23vqCGIVpfZ_K2RZs">Advanced Deep Learning &amp; Reinforcement Learning</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org40a940a" class="outline-2">
<h2 id="org40a940a"><span class="section-number-2">4</span> In connecting with others</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://github.com/otokonoko8/implicit-variational-inference">Repos: Advanced-variational-inference-paper</a></li>

<li><a href="https://github.com/otokonoko8/deep-Bayesian-nonparametrics-papers">Repos: Deep-Bayesian-nonparametrics-papers</a></li>
</ul>
</div>

<div id="outline-container-org4b02641" class="outline-3">
<h3 id="org4b02641"><span class="section-number-3">4.1</span> GANs</h3>
</div>

<div id="outline-container-org4951404" class="outline-3">
<h3 id="org4951404"><span class="section-number-3">4.2</span> Discrete GAN or RBM or Autoencoder</h3>
</div>

<div id="outline-container-orgb890afc" class="outline-3">
<h3 id="orgb890afc"><span class="section-number-3">4.3</span> Optimal Transport (likelihood-free learning)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
&#x2026; Matthed Thorpe, 2018, <a href="http://www.math.cmu.edu/~mthorpe/OTNotes">Introduction to Optimal Transport</a>
&#x2026; Peyre, Cuturi, 2018, Computational Optimal Transport, <a href="https://optimaltransport.github.io/resources/">Codes and slides for OT</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dong</p>
<p class="date">Created: 2020-05-20 Wed 12:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
